Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: བཅུམ་པ་རྣམ་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ། བདག་དང་འཇིག་རྟེན་རྟག་ཅེས་བྱ་བ་དེ་ཉིད་བདེན་གྱི། གཞན་ནི་དོན་མེད་དོ་ཅེས་བྱ་བ་དེ་ནི། གཟུགས་ལ་གནས་པའོ། །དེ་ནི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་།
en: In this regard, the tathāgatas, arhats, completely awakened buddhas know the diffused and absorbed, or expansive and narrow thoughts of other beings and other persons in the following manner: With regard to the notion ‘it is true that the self and the world are permanent; all else is nonsensical,’ they know that this refers to physical forms and that this refers to feelings, perceptions, formative predispositions, and consciousness.

source: རྣམ་པར་ཤེས་པ་ལ་གནས་པའོ། །བདག་དང་འཇིག་རྟེན་མི་རྟག་ཅེས་བྱ་བ་དེ་ཉིད་བདེན་གྱི། གཞན་ནི་དོན་མེད་དོ་ཞེས་བྱ་བ་དེ་ནི་གཟུགས་ལ་གནས་པའོ། །དེ་ནི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་གནས་པའོ།
en: With regard to the notion ‘it is true that the self and the world are impermanent; all else is nonsensical,’ they know that this refers to physical forms and that this refers to feelings, perceptions, formative predispositions, and consciousness.

source: །བདག་དང་འཇིག་རྟེན་རྟག་ཀྱང་རྟག་ལ། མི་རྟག་ཀྱང་མི་རྟག་ཅེས་བྱ་བ་དེ་ཉིད་བདེན་གྱི། གཞན་ནི་དོན་མེད་དོ། ཞེས་བྱ་བ་དེ་ནི་གཟུགས་ལ་གནས་པའོ། །དེ་ནི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་གནས་པའོ།
en: With regard to the notion ‘it is true that the self and the world are both permanent and impermanent; all else is nonsensical,’ they know that this refers to physical forms and that this refers to feelings, perceptions, formative predispositions, and consciousness.

source: །བདག་དང་འཇིག་རྟེན་ནི་རྟག་པ་འང་མ་ཡིན། མི་རྟག་པ་འང་མ་ཡིན། ཞེས་བྱ་བ་དེ་ཉིད་བདེན་གྱི། གཞན་ནི་དོན་མེད་པའོ་ཞེས་བྱ་བ་དེ་ནི་གཟུགས་ལ་གནས་པའོ། །དེ་ནི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་།
en: With regard to the notion ‘it is true that the self and the world are neither permanent nor impermanent; all else is nonsensical,’ they know that this refers to physical forms and that this refers to feelings, perceptions, formative predispositions, and consciousness.

source: རྣམ་པར་ཤེས་པ་ལ་གནས་པའོ། །བདག་དང་འཇིག་རྟེན་ནི་མཐའ་དང་ལྡན་པ་ཞེས་བྱ་བ་དེ་ཉིད་བདེན་གྱི། གཞན་ནི་དོན་མེད་དོ། །ཞེས་བྱ་བ་དེ་ནི་གཟུགས་ལ་གནས་པའོ། །དེ་ནི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་།
en: With regard to the notion ‘it is true that the self and the world are finite; all else is nonsensical,’ they know that this refers to physical forms and that this refers to feelings, perceptions, formative predispositions, and consciousness.

source: རྣམ་པར་ཤེས་པ་ལ་གནས་པའོ། བདག་དང་འཇིག་རྟེན་ནི་མཐའ་དང་མི་ལྡན་པ་ཞེས་བྱ་བ་དེ་ཉིད་བདེན་གྱི། གཞན་ནི་དོན་མེད་དོ་ཞེས་བྱ་བ་དེ་ནི་གཟུགས་ལ་གནས་པའོ། །དེ་ནི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་གནས་པའོ།
en: With regard to the notion ‘it is true that the self and the world are infinite; all else is nonsensical,’ they know that this refers to physical forms and that this refers to feelings, perceptions, formative predispositions, and consciousness.

source: །བདག་དང་འཇིག་རྟེན་ནི་མཐའ་དང་ལྡན་པ་ཡང་ཡིན་ལ། མཐའ་དང་མི་ལྡན་པ་ཡང་ཡིན་ཞེས་བྱ་བ་དེ་ཉིད་བདེན་གྱི། གཞན་ནི་དོན་མེད་དོ་ཞེས་བྱ་བ་དེ་ནི་གཟུགས་ལ་གནས་པའོ། །དེ་ནི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་གནས་པའོ།
en: With regard to the notion ‘it is true that the self and the world are both finite and infinite; all else is nonsensical,’ they know that this refers to physical forms and that this refers to feelings, perceptions, formative predispositions, and consciousness.

source: །བདག་དང་འཇིག་རྟེན་ནི་མཐའ་དང་ལྡན་པ་ཡང་མ་ཡིན། མཐའ་དང་མི་ལྡན་པ་ཡང་མ་ཡིན་ཞེས་བྱ་བ་དེ་ཉིད་བདེན་གྱི། གཞན་ནི་དོན་མེད་དོ་ཞེས་བྱ་བ་དེ་ནི་གཟུགས་ལ་གནས་པའོ། །དེ་ནི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་།
en: With regard to the notion ‘it is true that the self and the world are neither finite nor infinite; all else is nonsensical,’ they know that this refers to physical forms and that this refers to feelings, perceptions, formative predispositions, and consciousness. {

source: རྣམ་པར་ཤེས་པ་ལ་གནས་པའོ།
en: Ki.

source: །ལུས་དེ་སྲོག་དང་ལྡན་ཞེས་བྱ་བ་དེ་ཉིད་བདེན་གྱི། གཞན་ནི་དོན་མེད་དོ་ཞེས་བྱ་བ་དེ་ནི་གཟུགས་ལ་གནས་པའོ། །དེ་ནི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་གནས་པའོ།
en: IV: 65} With regard to the notion ‘it is true that the body possesses life; all else is nonsensical,’ they know that this refers to physical forms and that this refers to feelings, perceptions, formative predispositions, and consciousness.

source: །སྲོག་ཀྱང་གཞན་ལ་ལུས་ཀྱང་གཞན་ཞེས་བྱ་བ་དེ་ཉིད་བདེན་གྱི། གཞན་ནི་དོན་མེད་དོ་ཞེས་བྱ་བ་དེ་ནི་གཟུགས་ལ་གནས་པའོ། །དེ་ནི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་གནས་པའོ།
en: With regard to the notion ‘it is true that life is one thing and the body another; all else is nonsensical,’ they know that this refers to physical forms and that this refers to feelings, perceptions, formative predispositions, and consciousness.

source: །དེ་བཞིན་གཤེགས་པ་གྲོངས་ནས་ཡོད་ཅེས་བྱ་བ་དེ་ཉིད་བདེན་གྱི། གཞན་ནི་དོན་མེད་དོ་ཞེས་བྱ་བ་དེ་ནི་གཟུགས་ལ་གནས་པའོ། །དེ་ནི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་གནས་པའོ། །དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་གྲོངས་ནས་མེད་ཅེས་བྱ་བ་དང་།
en: With regard to the notion ‘it is true that the tathāgatas exist after death; all else is nonsensical,’ they know that this refers to physical forms and that this refers to feelings, perceptions, formative predispositions, and consciousness.

source: དེ་བཞིན་གཤེགས་པ་གྲོངས་ནས་ཡོད་ཀྱང་ཡོད་ལ་མེད་ཀྱང་མེད་ཅེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་གྲོངས་ནས་ཡོད་པར་འགྱུར་བ་ཡང་མ་ཡིན། མེད་པར་འགྱུར་བ་ཡང་མ་ཡིན་ཞེས་བྱ་བ་དེ་ཉིད་བདེན་གྱི། གཞན་ནི་དོན་མེད་དོ་ཞེས་བྱ་བ་དེ་ནི་གཟུགས་ལ་གནས་པའོ། །དེ་ནི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་གནས་པའོ།
en: With regard to the notions ‘it is true that the tathāgatas do not exist after death; that the tathāgatas both exist and do not exist after death, or that they neither exist nor not exist after death; and that the tathāgatas will neither continue to exist after death, nor will they not continue to exist after death; all else is nonsensical,’ they know that this refers to physical forms and that this refers to feelings, perceptions, formative predispositions, and consciousness.

source: །ཞེས་བྱ་བར་རབ་ཏུ་མཁྱེན་ཏེ། རབ་འབྱོར་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་བརྟེན་ཏེ། སེམས་ཅན་ཕ་རོལ་དང་། གང་ཟག་ཕ་རོལ་གྱི་སེམས་འཕྲོ་བ་དང་། འདུ་བ་དང་།
en: Subhūti, it is in that manner that, dependent on this profound perfection of wisdom, the tathāgatas, arhats, completely awakened buddhas correctly and definitively know the thoughts of other beings and other persons that are diffused or absorbed, and expansive or narrow. “

source: བཀྲམ་པ་དང་། བཅུམ་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །རབ་འབྱོར་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་བརྟེན་ཏེ། གཟུགས་མཁྱེན་ཏོ།
en: Moreover, Subhūti, the tathāgatas perceive physical forms through this profound perfection of wisdom.

source: །གཟུགས་ཇི་ལྟར་མཁྱེན་ཅེ་ན། དེ་བཞིན་ཉིད་དང་། མ་ནོར་བ་དེ་བཞིན་ཉིད་འགྱུར་བ་མེད་ཅིང་རྣམ་པར་རྟོག་པ་མེད་ལ། མཚན་མ་མེད་ཅིང་བྱེད་པ་མེད་དེ། སྤྲོས་པ་མེད་ཅིང་དམིགས་སུ་མེད་པ་དེ་ལྟར་མཁྱེན་ཏོ།
en: If you ask how they perceive physical forms, they perceive them as the real nature, the unmistaken real nature, unchanging, nonconceptual, signless, effortless, unelaborate, and nonapprehensible.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མཁྱེན་ཏོ།
en: They perceive feelings, perceptions, formative predispositions, and consciousness.

source: །རྣམ་པར་ཤེས་པ་ཇི་ལྟར་མཁྱེན་ཅེ་ན། དེ་བཞིན་ཉིད་དང་མ་ནོར་བ་དེ་བཞིན་ཉིད་འགྱུར་བ་མེད་ཅིང་རྣམ་པར་རྟོག་པ་མེད་ལ། མཚན་མ་མེད་ཅིང་བྱེད་པ་མེད་དེ།
en: If you ask how they perceive consciousness [and so forth], they perceive them as the real nature, the unmistaken real nature, unchanging, nonconceptual, signless, effortless, unelaborate, and nonapprehensible.

source: སྤྲོས་པ་མེད་ཅིང་དམིགས་སུ་མེད་པ་དེ་ལྟར་མཁྱེན་ཏོ། །རབ་འབྱོར་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་བརྟེན་ཏེ། སེམས་ཅན་ཕ་རོལ་དང་། གང་ཟག་ཕ་རོལ་གྱི་སེམས་འཕྲོ་བ་དང་། འདུ་བ་དང་། བཀྲམ་པ་དང་། བཅུམ་པ་རྣམས་ཀྱང་དེ་བཞིན་ཉིད་ཇི་ལྟ་བ་དེ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། འགྱུར་བ་མེད་པ་དང་། རྣམ་པར་རྟོག་པ་མེད་པ་དང་། མཚན་མ་མེད་པ་དང་། བྱེད་པ་མེད་པ་དང་། སྤྲོས་པ་མེད་པ་དང་། དམིགས་སུ་མེད་པ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་མཁྱེན་ཏོ།
en: Subhūti, it is in that manner that the tathāgatas definitively know, dependent on this profound perfection of wisdom, the real nature of the thoughts of other beings and other persons that are diffused or absorbed, and expansive or narrow, and that they definitively know their unmistaken real nature—unchanging, nonconceptual, signless, effortless, unelaborate, and nonapprehensible. “

source: །དེ་ལྟར་ན་འཕྲོ་བ་དང་འདུ་བ་དང་བཀྲམ་པ་དང་བཅུམ་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། ཕུང་པོའི་དེ་བཞིན་ཉིད་དོ།
en: So it is that the real nature of diffused or absorbed, and expansive or narrow [thoughts] is the real nature of the psycho-physical aggregates.

source: །ཕུང་པོའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། སྐྱེ་མཆེད་ཀྱི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of the psycho-physical aggregates is the real nature of the sense fields.

source: །སྐྱེ་མཆེད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། ཁམས་ཀྱི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of the sense fields is the real nature of the sensory elements.

source: །ཁམས་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of the sensory elements is the real nature of the links of dependent origination.

source: །རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of the links of dependent origination is the real nature of all phenomena.

source: །ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་གི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of all phenomena is the real nature of the six perfections.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་གི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། སྟོང་པ་ཉིད་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of the six perfections is the real nature of all the aspects of emptiness.

source: །སྟོང་པ་ཉིད་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་གྱི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of all the aspects of emptiness is the real nature of the thirty-seven factors conducive to enlightenment.

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་གྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། བསམ་གཏན་བཞིའི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of the thirty-seven factors conducive to enlightenment is the real nature of the four meditative concentrations.

source: །བསམ་གཏན་བཞིའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། ཚད་མེད་པ་བཞིའི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of the four meditative concentrations is the real nature of the four immeasurable attitudes.

source: །ཚད་མེད་པ་བཞིའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞིའི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of the four immeasurable attitudes is the real nature of the four formless absorptions.

source: །གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞིའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། མངོན་པར་ཤེས་པ་ལྔའི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of the four formless absorptions is the real nature of the five extrasensory powers.

source: །མངོན་པར་ཤེས་པ་ལྔའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། རྣམ་པར་ཐར་པ་བརྒྱད་ཀྱི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of the five extrasensory powers is the real nature of the eight aspects of liberation. {

source: །རྣམ་པར་ཐར་པ་བརྒྱད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི།
en: Ki.IV: 66} The real nature of the eight aspects of liberation is the real nature of the nine serial steps of meditative absorption.

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུའི་དེ་བཞིན་ཉིད་དོ། །མཐར་གྱིས་གནས་པའི་སྙོམས་བར་འཇུག་པ་དགུའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of the nine serial steps of meditative absorption is the real nature of the gateways of liberation—emptiness, signlessness, and wishlessness.

source: །རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུའི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of the gateways of liberation—emptiness, signlessness, and wishlessness—is the real nature of the ten powers of the tathāgatas.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། མི་འཇིགས་པ་བཞིའི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of the ten powers of the tathāgatas is the real nature of the four fearlessnesses.

source: །མི་འཇིགས་པ་བཞིའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞིའི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of the four fearlessnesses is the real nature of the four kinds of exact knowledge.

source: །སོ་སོ་ཡང་དག་པར་རིག་པ་བཞིའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། བྱམས་པ་ཆེན་པོའི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of the four kinds of exact knowledge is the real nature of great loving kindness.

source: །བྱམས་པ་ཆེན་པོའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། སྙིང་རྗེ་ཆེན་པོའི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of great loving kindness is the real nature of great compassion.

source: །སྙིང་རྗེ་ཆེན་པོའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of great compassion is the real nature of the eighteen distinct qualities of the buddhas.

source: །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་དོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། དགེ་བའི་ཆོས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of the eighteen distinct qualities of the buddhas is the real nature of virtuous phenomena.

source: །དགེ་བའི་ཆོས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། མི་དགེ་བའི་ཆོས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of virtuous phenomena is the real nature of nonvirtuous phenomena.

source: །མི་དགེ་བའི་ཆོས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། འཇིག་རྟེན་པའི་ཆོས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of nonvirtuous phenomena is the real nature of mundane phenomena.

source: །འཇིག་རྟེན་པའི་ཆོས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of mundane phenomena is the real nature of supramundane phenomena.

source: །འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། ཟག་པ་དང་བཅས་པའི་ཆོས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of supramundane phenomena is the real nature of contaminated phenomena.

source: །ཟག་པ་དང་བཅས་པའི་ཆོས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། ཟག་པ་མེད་པའི་ཆོས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of contaminated phenomena is the real nature of uncontaminated phenomena.

source: །ཟག་པ་མེད་པའི་ཆོས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་ཆོས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་དོ། །འདས་པ་དང་།
en: The real nature of uncontaminated phenomena is the real nature of past, future, and present phenomena.

source: མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་ཆོས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། འདུས་བྱས་དང་། འདུས་མ་བྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་དོ། །འདུས་བྱས་དང་།
en: The real nature of past, future, and present phenomena is the real nature of conditioned and unconditioned phenomena.

source: འདུས་མ་བྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུའི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of conditioned and unconditioned phenomena is the real nature of the fruit of entering the stream to nirvāṇa.

source: །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུའི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of the fruit of entering the stream to nirvāṇa is the real nature of the fruit of being destined for only one more rebirth.

source: །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། ཕྱིར་མི་འོང་བའི་འབྲས་བུའི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of the fruit of being destined for only one more rebirth is the real nature of the fruit of no longer being subject to rebirth.

source: །ཕྱིར་མི་འོང་བའི་འབྲས་བུའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། དགྲ་བཅོམ་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་དོ། །དགྲ་བཅོམ་པ་ཉིད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི།
en: The real nature of the fruit of no longer being subject to rebirth is the real nature of the fruit of arhatship.

source: རང་བྱང་ཆུབ་ཀྱི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of arhatship is the real nature of individual enlightenment.

source: །རང་བྱང་ཆུབ་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of individual enlightenment is the real nature of unsurpassed, complete enlightenment.

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི།
en: The real nature of unsurpassed, complete enlightenment {Ki.

source: དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་དོ།
en: IV: 67} is the real nature of the tathāgatas.

source: དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། དེ་བཞིན་ཉིད་གཅིག་པ་ཉིད་དེ་ཐ་མི་དད་པའི་དེ་བཞིན་ཉིད་དོ།
en: The real nature of the tathāgatas is the singular real nature, the undifferentiated real nature.

source: །ཐ་མི་དད་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི། མི་ཟད་པ་སྟེ་མི་ཟད་པའི་ཕྱིར་གཉིས་སུ་མེད་དེ། གཉིས་སུ་བྱར་མེད་དོ།
en: The undifferentiated real nature is inexhaustible, and because it is inexhaustible, it is not two things, and cannot be divided into two. “

source: །རབ་འབྱོར་དེ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་དེ། དེ་བཞིན་གཤེགས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་བརྟེན་ཏེ། མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: Subhūti, this is the real nature of all phenomena, with regard to which the tathāgatas attain consummate buddhahood dependent on this perfection of wisdom.

source: །རབ་འབྱོར་དེ་ལྟ་བས་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ནི། དེ་བཞིན་གཤེགས་པ་བསྐྱེད་པའོ། །འཇིག་རྟེན་འདི་སྟོན་པའོ།
en: So it is in that way, Subhūti, that this profound perfection of wisdom gives birth to the tathāgatas and reveals this world to them.

source: །རབ་འབྱོར་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཐུགས་སུ་ཆུད་དོ། །མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་ཐུགས་སུ་ཆུད་དོ།
en: Subhūti, it is in that manner that the tathāgatas, arhats, completely awakened buddhas understand the real nature of all phenomena, and understand the unmistaken real nature and the one and only real nature.

source: །དེ་བཞིན་ཉིད་དེས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤེས་བྱའོ།
en: It is owing to this real nature that the tathāgatas, arhats, completely awakened buddhas are so named.”

source: །རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་དང་། མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ལགས་པ་དེ་བཞིན་ཉིད་འདི་ནི་ཟབ་པ་སྟེ།
en: Subhūti then said, “Blessed Lord, this real nature of all phenomena, unmistaken real nature, and one and only real nature is profound.

source: བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་དང་། མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ལགས་པ་དེ་བཞིན་ཉིད་དེས་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བྱང་ཆུབ་བརྗོད་ཅིང་སྨོས་སོ།
en: Blessed Lord, it is owing to this real nature of all phenomena, unmistaken real nature, and one and only real nature that the enlightenment of the lord buddhas is expressed and described.

source: །བཅོམ་ལྡན་འདས་སླར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། གང་ཟག་ལྟ་བ་ཕུན་སུམ་ཚོགས་པ་རྣམས་དང་། དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ་རྣམས་མ་གཏོགས་པར་སུ་ཞིག་འདི་ལ་མོས་པར་འགྱུར།
en: Blessed Lord, except for bodhisattva great beings who are irreversible, persons of excellent view, and arhats whose contaminants are exhausted, who else will be devoted to this?

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་ཆོས་དེ་དག་མངོན་པར་སངས་རྒྱས་ནས། སེམས་ཅན་རྣམས་ལ་གསུངས་པ་ནི་ཤིན་དུ་ཟབ་བོ།
en: Blessed Lord, it is after tathāgatas have attained manifest buddhahood that these extremely profound realities are declared to beings.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་དེ་བཞིན་ཉིད་མི་ཟད་པ་སྟེ།
en: So it is, Subhūti, that the real nature is inexhaustible,” replied the Blessed One. “

source: ཅིའི་ཕྱིར་མི་ཟད་ཅེ་ན། ཆོས་ཐམས་ཅད་ནི་མི་ཟད་པའི་ཕྱིར་ཏེ།
en: If you ask why it is inexhaustible, it is because all phenomena are inexhaustible.

source: དེ་བཞིན་ཉིད་དེ་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་རྣམས་ལ་གསུངས་ཏེ།
en: It is after the tathāgatas, arhats, completely awakened buddhas have attained consummate buddhahood in unsurpassed, complete enlightenment that this real nature is declared to beings.

source: འདི་ལྟར་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་དོ།
en: Such is the real nature of all phenomena.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་སུམ་ཅུ་གཉིས་པའོ།། །།
en: This completes the thirty-second chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ཡོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་གང་ཇི་སྙེད་པ་དེ་དག་ལྷ་རྫས་ཀྱི་ཙན་དན་གྱི་ཕྱེ་མས་མངོན་པར་འཐོར་ཞིང་།
en: Chapter 33 Then all the gods inhabiting the realm of desire and inhabiting the realm of form, within this world system of the great trichiliocosm, as many as there were, scattered divine sandalwood powder.

source: བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་དོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས།
en: Approaching the place where the Blessed One was, they prostrated with their heads toward the feet of the Blessed One, and stood to one side.

source: འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ཡོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་གང་ཇི་སྙེད་པ་དེ་དག་གིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་བཤད་ན། བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོའི་མཚན་ཉིད་ཇི་ལྟ་བུ་ལགས།
en: Then, even as they stood to one side, all the gods inhabiting the realm of desire and inhabiting the realm of form, as many as there were, asked the Blessed One, “With regard to this profound perfection of wisdom that the Blessed Lord is explaining, what, Blessed Lord, are the defining characteristics of the profound perfection of wisdom?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལྷའི་བུ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ནི་སྟོང་པ་ཉིད་ཀྱི་མཚན་ཉིད་དོ།
en: Divine princes,” replied the Blessed One, “this profound perfection of wisdom has the defining characteristic of emptiness.

source: །ལྷའི་བུ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ནི་མཚན་མ་མེད་པའི་མཚན་ཉིད་དོ།
en: Divine princes, this profound perfection of wisdom has the defining characteristic of signlessness.

source: །ལྷའི་བུ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ནི། སྨོན་པ་མེད་པའི་མཚན་ཉིད་དོ།
en: Divine princes, this profound perfection of wisdom has the defining characteristic of wishlessness. {Ki.

source: །ལྷའི་བུ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ནི། མངོན་པར་འདུ་བྱ་བ་མེད་པའི་མཚན་ཉིད་དོ།
en: IV: 68} Divine princes, this profound perfection of wisdom has the defining characteristic of nonconditioning.

source: །ལྷའི་བུ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ནི། སྐྱེ་བ་མེད་པའི་མཚན་ཉིད་དོ།
en: Divine princes, this profound perfection of wisdom has the defining characteristic of nonarising.

source: །ལྷའི་བུ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ནི། འགག་པ་མེད་པའི་མཚན་ཉིད་དོ།
en: Divine princes, this profound perfection of wisdom has the defining characteristic of noncessation.

source: །ལྷའི་བུ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ནི། ཉོན་མོངས་པ་མེད་པའི་མཚན་ཉིད་དོ།
en: Divine princes, this profound perfection of wisdom has the defining characteristic of nonaffliction.

source: །ལྷའི་བུ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ནི། རྣམ་པར་བྱང་བ་མེད་པའི་མཚན་ཉིད་དོ།
en: Divine princes, this profound perfection of wisdom has the defining characteristic of nonpurification.

source: །ལྷའི་བུ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ནི། དངོས་པོ་མེད་པའི་མཚན་ཉིད་དོ།
en: Divine princes, this profound perfection of wisdom has the defining characteristic of nonentity.

source: །ལྷའི་བུ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ནི། ངོ་བོ་ཉིད་མེད་པའི་མཚན་ཉིད་དོ།
en: Divine princes, this profound perfection of wisdom has the defining characteristic of essencelessness.
